{
    "modelTopology": {
      "keras_version": "2.1.5",
      "backend": "tensorflow",
      "model_config": {
        "class_name": "Sequential",
        "config": [
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_1",
              "trainable": true,
              "batch_input_shape": [
                null,
                416,
                416,
                3
              ],
              "dtype": "float32",
              "filters": 16,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "LeakyReLU",
            "config": {
              "name": "leaky_re_lu_1",
              "trainable": true,
              "alpha": 0.10000000149012
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_1",
              "trainable": true,
              "pool_size": [
                2,
                2
              ],
              "padding": "valid",
              "strides": [
                2,
                2
              ],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_2",
              "trainable": true,
              "filters": 32,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "LeakyReLU",
            "config": {
              "name": "leaky_re_lu_2",
              "trainable": true,
              "alpha": 0.10000000149012
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_2",
              "trainable": true,
              "pool_size": [
                2,
                2
              ],
              "padding": "valid",
              "strides": [
                2,
                2
              ],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_3",
              "trainable": true,
              "filters": 64,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "LeakyReLU",
            "config": {
              "name": "leaky_re_lu_3",
              "trainable": true,
              "alpha": 0.10000000149012
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_3",
              "trainable": true,
              "pool_size": [
                2,
                2
              ],
              "padding": "valid",
              "strides": [
                2,
                2
              ],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_4",
              "trainable": true,
              "filters": 128,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "LeakyReLU",
            "config": {
              "name": "leaky_re_lu_4",
              "trainable": true,
              "alpha": 0.10000000149012
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_4",
              "trainable": true,
              "pool_size": [
                2,
                2
              ],
              "padding": "valid",
              "strides": [
                2,
                2
              ],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_5",
              "trainable": true,
              "filters": 256,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "LeakyReLU",
            "config": {
              "name": "leaky_re_lu_5",
              "trainable": true,
              "alpha": 0.10000000149012
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_5",
              "trainable": true,
              "pool_size": [
                2,
                2
              ],
              "padding": "valid",
              "strides": [
                2,
                2
              ],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_6",
              "trainable": true,
              "filters": 512,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "LeakyReLU",
            "config": {
              "name": "leaky_re_lu_6",
              "trainable": true,
              "alpha": 0.10000000149012
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_6",
              "trainable": true,
              "pool_size": [
                2,
                2
              ],
              "padding": "same",
              "strides": [
                1,
                1
              ],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_7",
              "trainable": true,
              "filters": 1024,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "LeakyReLU",
            "config": {
              "name": "leaky_re_lu_7",
              "trainable": true,
              "alpha": 0.10000000149012
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_8",
              "trainable": true,
              "filters": 512,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "LeakyReLU",
            "config": {
              "name": "leaky_re_lu_8",
              "trainable": true,
              "alpha": 0.10000000149012
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_9",
              "trainable": true,
              "filters": 425,
              "kernel_size": [
                1,
                1
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {
                  
                }
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      }
    },
    "weightsManifest": [
      {
        "paths": [
          "group1-shard1of1"
        ],
        "weights": [
          {
            "name": "conv2d_1\/kernel",
            "shape": [
              3,
              3,
              3,
              16
            ],
            "dtype": "float32"
          },
          {
            "name": "conv2d_1\/bias",
            "shape": [
              16
            ],
            "dtype": "float32"
          }
        ]
      },
      {
        "paths": [
          "group2-shard1of1"
        ],
        "weights": [
          {
            "name": "conv2d_2\/kernel",
            "shape": [
              3,
              3,
              16,
              32
            ],
            "dtype": "float32"
          },
          {
            "name": "conv2d_2\/bias",
            "shape": [
              32
            ],
            "dtype": "float32"
          }
        ]
      },
      {
        "paths": [
          "group3-shard1of1"
        ],
        "weights": [
          {
            "name": "conv2d_3\/kernel",
            "shape": [
              3,
              3,
              32,
              64
            ],
            "dtype": "float32"
          },
          {
            "name": "conv2d_3\/bias",
            "shape": [
              64
            ],
            "dtype": "float32"
          }
        ]
      },
      {
        "paths": [
          "group4-shard1of1"
        ],
        "weights": [
          {
            "name": "conv2d_4\/kernel",
            "shape": [
              3,
              3,
              64,
              128
            ],
            "dtype": "float32"
          },
          {
            "name": "conv2d_4\/bias",
            "shape": [
              128
            ],
            "dtype": "float32"
          }
        ]
      },
      {
        "paths": [
          "group5-shard1of1"
        ],
        "weights": [
          {
            "name": "conv2d_5\/kernel",
            "shape": [
              3,
              3,
              128,
              256
            ],
            "dtype": "float32"
          },
          {
            "name": "conv2d_5\/bias",
            "shape": [
              256
            ],
            "dtype": "float32"
          }
        ]
      },
      {
        "paths": [
          "group6-shard1of2",
          "group6-shard2of2"
        ],
        "weights": [
          {
            "name": "conv2d_6\/kernel",
            "shape": [
              3,
              3,
              256,
              512
            ],
            "dtype": "float32"
          },
          {
            "name": "conv2d_6\/bias",
            "shape": [
              512
            ],
            "dtype": "float32"
          }
        ]
      },
      {
        "paths": [
          "group7-shard1of5",
          "group7-shard2of5",
          "group7-shard3of5",
          "group7-shard4of5",
          "group7-shard5of5"
        ],
        "weights": [
          {
            "name": "conv2d_7\/kernel",
            "shape": [
              3,
              3,
              512,
              1024
            ],
            "dtype": "float32"
          },
          {
            "name": "conv2d_7\/bias",
            "shape": [
              1024
            ],
            "dtype": "float32"
          }
        ]
      },
      {
        "paths": [
          "group8-shard1of5",
          "group8-shard2of5",
          "group8-shard3of5",
          "group8-shard4of5",
          "group8-shard5of5"
        ],
        "weights": [
          {
            "name": "conv2d_8\/kernel",
            "shape": [
              3,
              3,
              1024,
              512
            ],
            "dtype": "float32"
          },
          {
            "name": "conv2d_8\/bias",
            "shape": [
              512
            ],
            "dtype": "float32"
          }
        ]
      },
      {
        "paths": [
          "group9-shard1of1"
        ],
        "weights": [
          {
            "name": "conv2d_9\/kernel",
            "shape": [
              1,
              1,
              512,
              425
            ],
            "dtype": "float32"
          },
          {
            "name": "conv2d_9\/bias",
            "shape": [
              425
            ],
            "dtype": "float32"
          }
        ]
      }
    ]
  }